Revit 2024 API
ElectricalAnalyticalNode.DisconnectFromUpstreamNode Method
 Disconnects from upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public void DisconnectFromUpstreamNode(
	ElementId upstreamNodeId
)
Visual Basic
Public Sub DisconnectFromUpstreamNode ( _
	upstreamNodeId As ElementId _
)
Visual C++
public:
void DisconnectFromUpstreamNode(
	ElementId^ upstreamNodeId
)
Parameters
upstreamNodeId
Type: Autodesk.Revit.DB.ElementId
 The upstream node id to disconnect from.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The id is not an analytical distribution node id. -or- The analytical distribution node can not disconnect from the upstream node.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace